Repository: bogdanbabych/0945BUT10201-lex2
Catalog: data/s01rawFiles/gnu-en--de-v03.tmx
Source language: en
Languages: de

source: Their goal was not freedom, just “success”, defined as “having many users.” They did not care whether these users had freedom, only that they should be numerous.
de: Ziel war nicht Freiheit, nur Erfolg, definiert als viele Benutzer habend. Es kümmerte nicht, ob diese Freiheit hatten, sie sollten nur zahlreich sein.

source: This led to a paradoxical situation where two different ways of counting the amount of freedom gave different answers to the question, “Is this program free?” If you judged based on the freedom provided by the distribution terms of the MIT release, you would say that X was free software.
de: Das führte zu einer paradoxen Situation, in der zwei unterschiedliche Sichtweisen, das Maß an Freiheit zu messen, verschiedene Antworten auf die Frage ergaben, „Ist das Programm frei?“ Würde man Freiheit nach den Vertriebsbedingungen des MIT beurteilen, würde man sagen, dass X11 freie Software war.

source: But if you measured the freedom of the average user of X, you would have to say it was proprietary software.
de: Aber gemessen an der Freiheit des durchschnittlichen X11-Benutzer müsste man sagen, es war proprietäre Software.

source: Most X users were running the proprietary versions that came with Unix systems, not the free version.
de: Die meisten X11-Benutzer führten die proprietären Versionen aus, die mit unfreien Unix-Systemen kamen, nicht die freie Version.

source: Copyleft and the GNU GPL The goal of GNU was to give users freedom, not just to be popular.
de: Copyleft und die GNU GPL Das Ziel von GNU war den Benutzern Freiheit zu geben, nicht nur beliebt zu sein.

source: So we needed to use distribution terms that would prevent GNU software from being turned into proprietary software.
de: Also mussten wir Vertriebsbedingungen verwenden, die verhindern würden, GNU-Software in proprietäre Software umzuwandeln.

source: The method we use is called “copyleft”.(1)
de: Die Methode, die wir verwenden, wird Copyleft genannt.(3)

source: Copyleft uses copyright law, but flips it over to serve the opposite of its usual purpose: instead of a means for restricting a program, it becomes a means for keeping the program free.
de: Copyleft nutzt das Urheberrecht, aber wendet es auf gegenteilige Weise des üblichen Zwecks an: statt einem Mittel zur Beschränkung eines Programms wird es zu einem Mittel, damit das Programm frei bleibt.

source: The central idea of copyleft is that we give everyone permission to run the program, copy the program, modify the program, and distribute modified versions—but not permission to add restrictions of their own.
de: Der Kerngedanke von Copyleft ist, jedem die Berechtigung zu geben, das Programm ausführen, kopieren, modifizieren und modifizierte Versionen verbreiten zu dürfen ‑ aber nicht die Berechtigung Beschränkungen hinzuzufügen.

source: Thus, the crucial freedoms that define “free software” are guaranteed to everyone who has a copy; they become inalienable rights.
de: Damit werden entscheidende Freiheiten, die Freie Software definieren, an jedermann garantiert, wer eine Kopie besitzt. Sie werden unveräußerliche Rechte.

source: For an effective copyleft, modified versions must also be free.
de: Für ein effektives Copyleft müssen modifizierte Versionen ebenfalls frei sein.

source: This ensures that work based on ours becomes available to our community if it is published.
de: Dadurch wird sichergestellt, dass das abgeleitete Werk unserer Gemeinschaft verfügbar wird, wenn es veröffentlicht wird.

source: When programmers who have jobs as programmers volunteer to improve GNU software, it is copyleft that prevents their employers from saying, “You can't share those changes, because we are going to use them to make our proprietary version of the program.”
de: Wenn Programmierer, die als solche arbeiten, freiwillig GNU-Software verbessern, ist es das Copyleft, was ihre Arbeitgeber davon abhält zu sagen: „Sie können diese Änderungen nicht mit anderen austauschen, weil wir sie nutzen werden, um unsere proprietäre Version des Programms daraus zu machen.“

source: The requirement that changes must be free is essential if we want to ensure freedom for every user of the program.
de: Die Anforderung, das Änderungen frei sein müssen, ist unerlässlich, wenn wir Freiheit für jeden Programmnutzer gewähren wollen.

source: The companies that privatized the X Window System usually made some changes to port it to their systems and hardware.
de: Die Unternehmen, die X11 privatisiert haben, machten für gewöhnlich einige Änderungen, um es auf ihre Systeme und ihre Hardware zu portieren.

source: These changes were small compared with the great extent of X, but they were not trivial.
de: Diese Änderungen waren im Vergleich mit dem großen Umfang von X11 gering, aber sie waren nicht trivial.

source: If making changes were an excuse to deny the users freedom, it would be easy for anyone to take advantage of the excuse.
de: Wenn gemachte Änderungen Vorwand wären, um den Nutzern Freiheit zu versagen, wäre es für jedermann einfach, die Vorteile als Vorwand auszunutzen.

source: A related issue concerns combining a free program with nonfree code.
de: Ein ähnliches Problem betrifft die Kombination eines freien Programms mit unfreiem Quellcode.

source: Such a combination would inevitably be nonfree; whichever freedoms are lacking for the nonfree part would be lacking for the whole as well.
de: Solch eine Kombination wäre zwangsläufig unfrei!

source: To permit such combinations would open a hole big enough to sink a ship.
de: Welche Freiheiten auch immer dem unfreien Teil fehlt, würde dem Ganzen auch fehlen.

source: Therefore, a crucial requirement for copyleft is to plug this hole: anything added to or combined with a copylefted program must be such that the larger combined version is also free and copylefted.
de: Solche Kombinationen zu erlauben, würde ein Loch öffnen, groß genug, um ein Schiff darin zu versenken.

source: The specific implementation of copyleft that we use for most GNU software is the GNU General Public License, or GNU GPL for short. We have other kinds of copyleft that are used in specific circumstances.
de: Daher ist eine unabdingbare Anforderung für Copyleft, dieses Loch zu stopfen: etwas einem mit Copyleft versehenem Programm hinzuzufügen oder zu kombinieren muss so erfolgen, dass die daraus größere kombinierte Version ebenfalls frei und mit Copyleft ist.

source: GNU manuals are copylefted also, but use a much simpler kind of copyleft, because the complexity of the GNU GPL is not necessary for manuals.(2) (1) In 1984 or 1985, Don Hopkins (a very imaginative fellow) mailed me a letter.
de: Die konkrete Umsetzung des Copyleft, die wir für die meiste GNU-Software verwenden, ist die GNU General Public License, kurz GNU GPL. Wir haben auch noch andere Arten des Copyleft, die unter bestimmten Umständen verwendet werden.

source: On the envelope he had written several amusing sayings, including this one: “Copyleft—all rights reversed.” I used the word “copyleft” to name the distribution concept I was developing at the time.
de: GNU-Handbücher sind ebenfalls mit Copyleft versehen, verwenden aber ein viel einfacheres Copyleft, weil die Komplexität der GNU GPL für Handbücher nicht notwendig ist.(4)

source: (2) We now use the GNU Free Documentation License for documentation. The Free Software Foundation As interest in using Emacs was growing, other people became involved in the GNU project, and we decided that it was time to seek funding once again.
de: Free Software Foundation Da das Interesse an der Nutzung von Emacs wuchs, andere Personen am GNU-Projekt beteiligt wurden und wir beschlossen, dass es Zeit war erneut nach finanziellen Mitteln zu suchen, schufen wir 1985 die Free Software Foundation (FSF), eine gemeinnützige Stiftung für die Freie-Software-Förderung und -Entwicklung.

source: So in 1985 we created the Free Software Foundation (FSF), a tax-exempt charity for free software development.
de: Die FSF übernahm auch das Vertriebsgeschäft der Emacs-Magnetbänder.

source: The FSF also took over the Emacs tape distribution business; later it extended this by adding other free software (both GNU and non-GNU) to the tape, and by selling free manuals as well.
de: Später wurde dies durch Hinzufügen weiterer freier Software zum Magnetband (sowohl GNU als auch GNU-fremder) und natürlich durch den Verkauf freier Handbücher erweitert.

source: Most of the FSF's income used to come from sales of copies of free software and of other related services (CD-ROMs of source code, CD-ROMs with binaries, nicely printed manuals, all with the freedom to redistribute and modify), and Deluxe Distributions (distributions for which we built the whole collection of software for the customer's choice of platform).
de: Der größte Teil der Einnahmen der FSF kam aus den Verkäufen von Kopien freier Software und anderen damit zusammenhängenden Diensten (CD-ROMs mit Quellcode oder Binärdateien, schön gedruckten Handbüchern, alle mit der Freiheit weitergegeben und modifiziert zu werden) und Deluxe-Distributionen (in denen wir eine ganze Softwaresammlung nach Wahl des Kunden je nach Plattform zusammenstellten).

source: Today the FSF still sells manuals and other gear, but it gets the bulk of its funding from members' dues.
de: Noch heute vertreibt die FSF Handbücher und andere Utensilien, erhält aber den Großteil ihrer Mittel aus Mitgliedsbeiträgen.

source: You can join the FSF at fsf.org.
de: Sie können der FSF unter FSF.org beitreten.

source: Free Software Foundation employees have written and maintained a number of GNU software packages.
de: Mitarbeiter der Free Software Foundation haben eine Reihe von GNU-Softwarepaketen geschrieben und betreut.

source: Two notable ones are the C library and the shell.
de: Zwei beachtenswerte sind die C-Bibliothek und die Eingabeaufforderung.

source: The GNU C library is what every program running on a GNU/Linux system uses to communicate with Linux.
de: Die GNU C-Bibliothek wird von jedem auf einem GNU/Linux-System ausgeführten Programm genutzt, um mit Linux zu kommunizieren.

source: It was developed by a member of the Free Software Foundation staff, Roland McGrath.
de: Sie wurde von einem Mitarbeiter der Free Software Foundation, Roland McGrath, entwickelt.

source: The shell used on most GNU/Linux systems is BASH, the Bourne Again Shell(1), which was developed by FSF employee Brian Fox.
de: Der auf den meisten GNU/Linux-Systemen genutzte Befehlszeileninterpreter ist Bourne Again Shell (BASH)[5], entwickelt von Brian Fox, einem FSF-Mitarbeiter.

source: We funded development of these programs because the GNU Project was not just about tools or a development environment.
de: Wir finanzierten die Entwicklung dieser Programme, weil es beim GNU-Projekt nicht nur um Dienstprogramme oder eine Entwicklungsumgebung ging.

source: Our goal was a complete operating system, and these programs were needed for that goal.
de: Unser Ziel war ein vollständiges Betriebssystem, und diese Programme waren für dieses Ziel erforderlich.

source: (1) “Bourne Again Shell” is a play on the name “Bourne Shell”, which was the usual shell on Unix.
de: Freie-Software-Unterstützung Die Freie-Software-Philosophie lehnt eine bestimmte weitverbreitete Geschäftspraxis ab, aber ist nicht gegen das Geschäft.

source: Free software support The free software philosophy rejects a specific widespread business practice, but it is not against business.
de: Wenn Geschäfte die Freiheit der Nutzer respektieren, wünschen wir ihnen Erfolg.

source: When businesses respect the users' freedom, we wish them success. Selling copies of Emacs demonstrates one kind of free software business.
de: Der Verkauf von Emacs-Kopien veranschaulicht eine Art von Freie-Software-Geschäft.

source: When the FSF took over that business, I needed another way to make a living.
de: Als die FSF dieses Geschäft übernahm, brauchte ich einen anderen Weg, um meinen Lebensunterhalt zu bestreiten.

source: I found it in selling services relating to the free software I had developed.
de: Ich fand ihn im Anbieten von Dienstleistungen in Zusammenhang mit der freien Software, die ich entwickelt hatte.

source: This included teaching, for subjects such as how to program GNU Emacs and how to customize GCC, and software development, mostly porting GCC to new platforms.
de: Dies beinhaltete die Unterweisung zu Themen wie man beispielsweise GNU Emacs programmiert und GCC anpasst und Softwareentwicklung, hauptsächlich das Portieren von GCC auf neue Plattformen.

source: Today each of these kinds of free software business is practiced by a number of corporations.
de: Heutzutage wird jede Art von Freie-Software-Geschäft von einer Reihe von Unternehmen praktiziert.

source: Some distribute free software collections on CD-ROM; others sell support at levels ranging from answering user questions, to fixing bugs, to adding major new features.
de: Einige vertreiben Freie-Software-Sammlungen auf CD-ROM. Andere bieten Unterstützung, angefangen mit der Beantwortung von Benutzerfragen, Beseitigung von Programmfehlern, Hinzufügen neuer Programmfunktionen.

source: We are even beginning to see free software companies based on launching new free software products.
de: Wir fangen sogar an Freie-Software-Unternehmen zu sehen, die aufgrund neuer Freie-Software-Produkte gegründet werden.

source: Watch out, though—a number of companies that associate themselves with the term “open source” actually base their business on nonfree software that works with free software.
de: Passen Sie dennoch auf: Obwohl es eine Reihe von Unternehmen gibt, die sich dem Begriff „Open Source“ verbunden fühlen, basiert ihr Geschäft tatsächlich auf unfreier Software, die mit freier Software arbeitet.

source: These are not free software companies, they are proprietary software companies whose products tempt users away from freedom.
de: Das sind keine Freie-Software-Unternehmen, sondern proprietäre Softwareunternehmen, deren Produkte Benutzer von Freiheit weg in Versuchung führen.

source: They call these programs “value-added packages”, which shows the values they would like us to adopt: convenience above freedom.
de: Sie nennen diese Programme Mehrwertpakete, die die Werte widerspiegeln, die sie gerne als von uns adaptiert sehen würden: Nutzen über Freiheit.

source: If we value freedom more, we should call them “freedom-subtracted” packages.
de: Wenn wir Freiheit höher schätzen, sollten sie freiheitsentziehende Pakete genannt werden.

source: Technical goals The principal goal of GNU is to be free software.
de: Technische Ziele Das primäre Ziel von GNU soll Freie Software sein.

source: Even if GNU had no technical advantage over Unix, it would have a social advantage, allowing users to cooperate, and an ethical advantage, respecting the user's freedom.
de: Selbst wenn GNU keinen technischen Vorteil gegenüber Unix hätte, gäbe es einen sozialen Vorteil, der Nutzern erlaubt zusammenzuarbeiten, und einen ethischen Vorteil, der die Freiheit des Nutzers respektiert.

source: But it was natural to apply the known standards of good practice to the work—for example, dynamically allocating data structures to avoid arbitrary fixed size limits, and handling all the possible 8-bit codes wherever that made sense.
de: Aber es war selbstverständlich, die bekannten Standards guter Praxis auf die Arbeit anzuwenden ‑ etwa die dynamische Zuweisung von Datenstrukturen, um willkürliche feste Größenbegrenzungen zu vermeiden, und die Handhabung aller möglichen 8-Bit-Codes, wann immer das Sinn macht.

source: In addition, we rejected the Unix focus on small memory size, by deciding not to support 16-bit machines (it was clear that 32-bit machines would be the norm by the time the GNU system was finished), and to make no effort to reduce memory usage unless it exceeded a megabyte.
de: Darüber hinaus lehnten wir den Unix-Fokus auf kleine Speichergrößen ab und entschieden, 16-Bit-Rechner nicht zu unterstützen (es war klar, dass 32-Bit-Rechner Standard sind, wenn das GNU-System fertig wäre) und keine Anstrengungen zu machen die Speichernutzung zu verringern, wenn es einen Megabyte überstieg.

source: In programs for which handling very large files was not crucial, we encouraged programmers to read an entire input file into core, then scan its contents without having to worry about I/O.
de: In Programmen, für die die Behandlung von großen Dateien nicht entscheidend war, ermutigten wir Programmierer die gesamte Eingabedatei in den Prozessorkern einzulesen, dann seinen Inhalt zu überprüfen, ohne sich um Ein- und Ausgabe kümmern zu müssen.

source: These decisions enabled many GNU programs to surpass their Unix counterparts in reliability and speed.
de: Diese Entscheidungen ermöglichten vielen GNU-Programmen, ihre Unix-Gegenstücke in Zuverlässigkeit und Geschwindigkeit zu übertreffen.

source: Donated computers As the GNU Project's reputation grew, people began offering to donate machines running Unix to the project.
de: Gespendete Rechner Als der Ruf des GNU-Projekts wuchs, begann man Rechner als Spende für das Projekt anzubieten, die unter Unix liefen.

source: These were very useful, because the easiest way to develop components of GNU was to do it on a Unix system, and replace the components of that system one by one.
de: Diese waren sehr nützlich, weil der einfachste Weg, die Entwicklung von GNU-Komponenten auf einem Unix-System zu tun, und dessen Komponenten eins nach dem anderen zu ersetzen ‑ eine nach der anderen.

source: But they raised an ethical issue: whether it was right for us to have a copy of Unix at all.
de: Aber das löste eine ethische Frage aus: ob es für uns richtig war, überhaupt eine Kopie von Unix zu besitzen.

source: Unix was (and is) proprietary software, and the GNU Project's philosophy said that we should not use proprietary software.
de: Unix war (und ist) proprietäre Software, und die Philosophie des GNU-Projekts besagt, dass wir keine proprietäre Software nutzen sollten.

source: But, applying the same reasoning that leads to the conclusion that violence in self defense is justified, I concluded that it was legitimate to use a proprietary package when that was crucial for developing a free replacement that would help others stop using the proprietary package.
de: Aber die gleiche Argumentation anwendend, die zu der Schlussfolgerung führt, dass Gewalt als Selbstverteidigung gerechtfertigt sei, schloss ich, dass es legitim wäre, ein proprietäres Paket zu nutzen, wenn das für die Entwicklung eines freien Ersatzes entscheidend war, der anderen helfen würde, das proprietäre Paket nicht mehr zu verwenden.

source: But, even if this was a justifiable evil, it was still an evil.
de: Aber selbst wenn dies ein gerechtfertigtes Übel war, war es immer noch ein Übel.

source: Today we no longer have any copies of Unix, because we have replaced them with free operating systems.
de: Heute haben wir nicht mehr irgendwelche Kopien von Unix, weil wir sie durch freie Betriebssysteme ersetzten.

source: If we could not replace a machine's operating system with a free one, we replaced the machine instead.
de: Konnten wir das Betriebssystem eines Rechners nicht ersetzen, ersetzten wir stattdessen den Rechner.

source: The GNU Task List As the GNU Project proceeded, and increasing numbers of system components were found or developed, eventually it became useful to make a list of the remaining gaps.
de: GNU-Aufgabenliste Mit Fortschreiten des GNU-Projekts und immer mehr gefundenen oder entwickelten Systemkomponenten wurde schließlich eine Liste der verbleibenden Lücken notwendig.

source: We used it to recruit developers to write the missing pieces.
de: Wir verwendeten sie, um Entwickler zu rekrutieren, fehlende Teile zu schreiben.

source: This list became known as the GNU Task List.
de: Diese Liste wurde als GNU-Aufgabenliste bekannt.

source: In addition to missing Unix components, we listed various other useful software and documentation projects that, we thought, a truly complete system ought to have.
de: Zusätzlich zu fehlenden Unix-Komponenten führten wir verschiedene andere nützliche Software- und Dokumentationsprojekte auf, die unserer Meinung nach ein Gesamtsystem haben sollte.

source: Today (1), hardly any Unix components are left in the GNU Task List—those jobs had been done, aside from a few inessential ones.
de: Heute sind kaum noch Unix-Komponenten in der GNU Task List[6] vorhanden ‑ diese sind, abgesehen von ein paar unwichtigen, abgearbeitet.

source: But the list is full of projects that some might call “applications”.
de: Aber die Liste ist voll von Projekten, die manche „Anwendungen“ nennen mögen.

source: Any program that appeals to more than a narrow class of users would be a useful thing to add to an operating system.
de: Jedes Programm, das mehr als nur eine kleine Benutzergruppe anspricht, wäre sinnvoll, um es einem Betriebssystem hinzuzufügen.

source: Even games are included in the task list—and have been since the beginning.
de: Sogar Spiele sind in der Aufgabenliste enthalten ‑ und sind von Anfang an dabei.

source: Unix included games, so naturally GNU should too.
de: Unix enthielt Spiele, also sollte GNU natürlich auch welche enthalten.

source: But compatibility was not an issue for games, so we did not follow the list of games that Unix had.
de: Da aber Kompatibilität kein Problem für Spiele war, mussten wir der Liste der Spiele nicht folgen, die Unix hatte.

source: Instead, we listed a spectrum of different kinds of games that users might like. (1) That was written in 1998.
de: Stattdessen führten wir ein Spektrum verschiedener möglicher Spiele auf, die Benutzer mögen würden.

source: In 2009 we no longer maintain a long task list. The community develops free software so fast that we can't even keep track of it all.
de: GNU Library GPL Die GNU C-Bibliothek nutzt eine spezielle Art des Copyleft namens GNU Library General Public License (LGPL), die die Berechtigung erteilt, proprietäre Software mit der Bibliothek zu verbinden.(7) Warum diese Ausnahme?

source: Instead, we have a list of High Priority Projects, a much shorter list of projects we really want to encourage people to write.
de: Es ist keine Frage des Prinzips.

source: The GNU Library GPL The GNU C library uses a special kind of copyleft called the GNU Library General Public License(1), which gives permission to link proprietary software with the library. Why make this exception?
de: Es gibt kein Prinzip, das proprietäre Softwareprodukte berechtigt unseren Quellcode einzubinden (warum zu einem Projekt beitragen, welches sich weigert, sich mit uns auszutauschen?).

source: It is not a matter of principle; there is no principle that says proprietary software products are entitled to include our code.
de: Die LGPL für die C-Bibliothek (oder für jedwede Bibliothek) zu verwenden, ist eine Frage der Strategie.

source: (Why contribute to a project predicated on refusing to share with us?) Using the LGPL for the C library, or for any library, is a matter of strategy.
de: Die C-Bibliothek erfüllt eine allgemeine Aufgabe.

source: The C library does a generic job; every proprietary system or compiler comes with a C library.
de: Jedes proprietäre System oder jeder Compiler kommt mit einer C-Bibliothek.

source: Therefore, to make our C library available only to free software would not have given free software any advantage—it would only have discouraged use of our library.
de: Deshalb hätte, wäre unsere C-Bibliothek ausschließlich für Freie Software verfügbar, dieser keinen Vorteil bringen ‑ es hätte nur von der Nutzung unserer Bibliothek abgehalten.
